Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/D16.tmx
Source language: en_us
Languages: zh_cn

source: The Twelve Deeds of the Buddha
zh_cn: 佛陀十二行谊

source: There are very many great deeds of the Buddha recorded but these can be summarized into the twelve most important, most famous deeds.
zh_cn: 有记载的佛陀的伟大行谊有很多很多，但可以概括为最重要、最有名的十二事。

source: First Deed: Descending from Tushita
zh_cn: 第一行谊：兜率降生

source: When the Buddha was teaching in the paradise of Tushita, which is a realm where the devas (gods) reside and also a sambhogakaya realm, the sound of his previous motivation reminded him that it was necessary to take birth in our world and teach the dharma.
zh_cn: 当佛陀在兜率天（佛经中指天人所居之处，也是一个报身佛的世界）讲法时，来自他过去业力的声音提醒他，要在我们这个世界降生、教导正法。

source: He then considered five things: the land where he ought to be born (which was Kapila in Nepal), the caste he should be born into (which was a royal caste), the family in which he should be born (which was the Shakya clan), who his mother was to be (she was Mayadevi), and the time that was right for him to be born (which happened to be when the five degenerations were on the increase,the present time).
zh_cn: 在降生前，佛陀还考虑了五件事：何地降生(现在尼泊尔的迦毗罗卫国)；何阶层降生（刹帝利）；何族降生（释迦族）；何为其母（摩耶夫人）；何时降生（当前正值五浊恶世）。

source: After having made these determinations, he decided to leave the Tushita paradise and take birth in our world.
zh_cn: 做完这些决定后，佛陀就决定离开兜率天，到我们这个世界降生。

source: This particular deed of leaving Tushita to be born had a special significance.
zh_cn: 佛陀离开兜率天降生人世这一行为有着特别的意义。

source: It was intended to teach us that somebody who has achieved enlightenment is no longer a slave of his own karma and has control over anything he or she does.
zh_cn: 这是想使我们领悟到觉悟之人不再受自己的业力束缚，能够主宰自己所有的行为。

source: So the Buddha chose to take birth in our world because the time was right and he wanted to show us that someone who is enlightened has control over anything he or she does.
zh_cn: 所以佛陀选择在我们这个世界出生，是由于合适的时机，同时也想告知我们，开悟之人不受束缚、完全自主。

source: Second Deed: Conception into the Womb
zh_cn: 第二行谊：入住母胎

source: The Buddha was conceived into the womb of his mother, Mayadevi (by taking the form of a White Elephant descending from Tushita and entering the womb immaculately) .
zh_cn: 佛陀化身一头白色大象，从兜率天降临，以圣洁的方式进入了他母亲摩耶夫人的腹中。

source: One may wonder why he was conceived and then took birth.
zh_cn: 有人或许想知道佛陀为什么能入胎和出生。

source: If he had complete control over everything, then why wasn't he born miraculously from a lotus flower as was Padmas ambhava or why couldn't he simply descend from the sky?
zh_cn: 如果一个人可以完全控制一切，为什么他不能如莲花生大士一样奇迹般地从一朵莲花中出生呢？又或者为什么他竟然连简单地从天上下来也做不到呢？

source: The Buddha had a special reason for being born the normal way.
zh_cn: 佛陀之所以选择正常的出生方式是有着特别的原因的。

source: If he had been born miraculously from a lotus, for example, it would have been very impressive and attracted many people.
zh_cn: 举个例子，如果他是奇迹般地从一朵莲花中诞生，这将会让人印象深刻并会吸引很多人前来。

source: However, the Buddha was thinking in the long term of his future disciples who would be inspired because the Buddha, who practiced and achieved enlightenment, started out like ourselves.
zh_cn: 然而，佛陀从更长远地角度思考为让未来的弟子受到激励：看，佛陀曾经就是和我们一样的人，经由修行而开悟的。

source: Had he been born in a lotus they would have thought no ordinary human beings could reach enlightenment because they didn't have these same miraculous powers.
zh_cn: 如果佛陀是从莲花中诞生的，就没有人会认为普通人可以开悟，因为一般人没有佛陀这样的神力。

source: So the Buddha entered the womb, he was conceived, to show that even ordinary human beings can achieve the highest realization. He did this to instill conviction and confidence in his future disciples.
zh_cn: 佛陀之所以选择进入子宫、住胎，就是为了告诉众生，即使普通人也能达到最高的自我实现，并把这种信念和自信灌输给他未来的弟子。

source: Third Deed: Birth in the garden of Lumbini, in present day Nepal
zh_cn: 第三行谊：蓝毗尼园诞生，今天的尼泊尔境内

source: Although the Buddha took an ordinary human birth, there was still something very special in his birth.
zh_cn: 尽管佛陀选择了凡人的出生方式，在他出生时仍有一些特别的事发生。

source: The Buddha came out of the body of his mother through her right side.
zh_cn: 佛陀从他母亲的右胁而生。

source: Some people might wonder how this was possible.
zh_cn: 一些人或许会想，这怎么可能？！

source: They might think, "Well, what exactly happened?
zh_cn: 他们或许会想，“好吧，究竟发生了什么事？

source: Did the rib cage crack?"
zh_cn: 胸腔打开了吗？”

source: One doesn't need to think in terms of anatomical problems because the Buddha was amiraculous being and he just took birth through his mother's right side without any pain or obstacle.
zh_cn: 这无需从解剖学的角度思考，因为佛陀是超自然的存在，他只是从他母亲的右胁诞生了，没有痛苦、也没有障碍。

source: At the time of the Buddha's birth, there were many very special things happening where he was born.
zh_cn: 在佛陀出生时，在他诞生的地方有许多很奇特的事发生。

source: All of a sudden, crops started growing.
zh_cn: 突然之间，谷物开始生长。

source: Trees appeared all over the area of Lumbini and rare flowers such as the Udumbara flower, that had never grown in this area, started blooming everywhere.
zh_cn: 蓝毗尼园处处长出了树，以及象从未在这个地方出现的稀有的优昙婆罗花也开始到处绽放。

source: Due to these events, from that moment onwards, he was given the name Siddhartha inSanskrit, or Tungye Drup in Tibetan, which means, "the one that makes everything possible."
zh_cn: 由于这些神奇的事件，自那一时刻起，佛陀有了一个梵文名字“悉达多”，藏文是Tungye Drup，它的意思是“无所不能的人”。

source: As a result of interdependent origination, the presence of a highly accomplished individual produces changes in the environment such as the blossoming of flowers (as in the case of the Buddha right after his birth).
zh_cn: 由于互相依存的因缘，一个有着极高成就的人的出现在环境中产生了相应的变化，如绽放的花儿（就发生在佛陀刚出生后）。

source: Fourth Deed: Training in the Arts, Crafts and Sciences.
zh_cn: 第四行谊：学习语文学、工艺学和医药学

source: A few years later when the Buddha had grown up a little, he was educated and thus became very knowledgeable, very scholarly, and very skillful.
zh_cn: 几年之后，佛陀长大了一些，就接受了教育，从而成为一个非常博学、学问精深和技艺精湛的人。

source: This maybe a little surprising, because the Buddha was already enlightened or at least a great bodhisattva residing in the tenth bodhisattva level (bhumi; there are ten stages to a Bodhisattva' s development, the tenth being the final stage before Buddhahood).
zh_cn: 这或许有些奇怪，因为佛陀已经开悟了或至少是一位伟大的处于十地果位的菩萨(菩萨地：在菩萨道上有十个果位，十地菩萨是成佛前的最后一个阶段)。

source: People might think it should not have been necessary for him to train inworldly skills because he should have known them naturally.
zh_cn: 一些人也许认为佛陀没有必要接受这些世间技艺的学习，他应该天生就知道。

source: However, there was again a specific reason for doing this.
zh_cn: 然而，这样做同样是有特殊的原因。

source: It was to counteract various misconceptions we might have had.
zh_cn: 这是对为了消除我们可能已有的种种误解。

source: One misunderstanding was to think that theBuddha was someone who was simply a meditator without any academic education.
zh_cn: 一个误解是认为佛陀只是是一个没有任何专业知识的修行人。

source: Another misconception was the idea that he already possessed all this knowledge so he didn't need to learn.
zh_cn: 另一个误解就是认为佛陀已经具备了所有知识，不需要再学习。

source: This could give rise to concerns that if we humans tried to learn something it would lead to no results.
zh_cn: 这样可能产生担心，诸如若我们人类尝试去学习一些知识，将会毫无意义。

source: Or again people might think that the Buddha did not have any qualities and that he never had to train.
zh_cn: 有些人或许还是会想，佛陀就是佛陀，他不需要培养。

source: So to overcome these misconceptions the Buddha worked at becoming a scholar and became very skilled in all different arts.
zh_cn: 为了消除这些错误的知见，佛陀致力于成为一个学者，并因此对各种不同的技艺都精通烂熟。

source: It also shows that it is necessary to receive full education in the culture in which we are born.
zh_cn: 这也是在展示，全面地学习我们出生地的各种文化是必要的。

source: We must therefore be apart of the various positive aspects of our culture and then become a vehicle for transmitting the dharma.
zh_cn: 我们必须以此先成为我们文化中的各种积极元素之一，然后再依之传播正法。

source: Fifth Deed: Marriage to Yashodhara, the birth of his son Rahula and the enjoyment of royalty.
zh_cn: 第五行谊：和耶输陀罗结婚，儿子罗睺罗出生以及享受王族生活

source: The Buddha did this so that his future disciples wouldn't think that theBuddha or an enlightened person was unable to enjoy any pleasures or feel the need for enjoyment.
zh_cn: 佛陀这样做是为了告诉他未来的弟子，并非佛陀或觉悟的人，就不能享受任何快乐或无法体会享受的需要。

source: The other reason for the Buddha living such a sensuous life was to show that even though the Buddha had all the finest pleasures, he wasn't satisfied by these pleasures because he understood that there was a higher form of happiness to be sought.
zh_cn: 佛陀过这种情感生活，另一个原因是是要表示，即便已经拥有了世间无上的享乐，依然不能让他满意，因为他明白这个世界上还有一种更高形式的快乐有待探寻。

source: Sixth Deed: Renunciation of Samsara, Leaving his life as a Prince
zh_cn: 第六行谊：出家，放弃王子的生活

source: The royal palace where the Buddha stayed was enclosed with high walls and four gates facing each of the cardinal points.
zh_cn: 佛陀居住的宫殿与世隔绝，四周是高高的城墙，分别有四扇门朝向东南西北四个方位。

source: The Buddha went for a walk outside of the precincts of the palace, each time leaving through one of the different gates, and each time he saw something that gave him a different lesson on life.
zh_cn: 佛陀离开宫殿到外面散步，每当他经过一扇不同的门，每次就看到不同的一幕，这给佛陀上了不同的人生课程。

source: The first time he went out through the eastern gate of the palace and saw the suffering of an old man, discovering for the first time that all persons experience the degeneration of the body.
zh_cn: 第一次佛陀穿过宫殿的东门外出，在那里遇到一个年迈的男性，第一次体会到每个人的身体都会衰老。

source: Another time he left the palace through the southern gate and saw a sick person and discovered the suffering that allpersons at one time or another suffer.
zh_cn: 第二次佛陀离开宫殿穿过南门，见到了一个生病的人，意识到所有人都会在某个时候经历生病的痛苦。

source: The next time he went out through the western gate and saw a dead person and discovered the pain of death which allpersons must undergo.
zh_cn: 接下来他离开西门看到了一个死人，明白每个人都将经历死亡的痛苦。

source: This hit him hard because he realized that no matter how rich you are, no matter how powerful you are, no matter how much pleasure and enjoyment you have, there is nothing you can do to run away from the suffering of old age, sickness, and death.
zh_cn: 这些见闻深深地震撼了佛陀，他知道无论你多么富有、多么有权势，拥有多少娱乐和享受，都无法避免这些苦：年老、生病和死亡。

source: He realized that there was no way to avoid these; even a king could not buy his way out of this suffering.
zh_cn: 他意识到没有办法可以避免这些，即使是一个国王也无法买到摆脱这些痛苦的处方。

source: No one can runaway and hide from this suffering.
zh_cn: 没有人可以逃离或躲避这些痛苦。

source: No one can fight and defeat these three kinds of suffering.
zh_cn: 没有人能够与这三种苦抗争并击败它们。

source: But then the Buddha realized that maybe there is a way out: the practice of a spiritual path. The Buddha understood this when he left the palace through the northern gate and saw a begging monk.
zh_cn: 然而当佛陀经过北门离开宫殿时，看到了一个乞讨的出家人，他推断也许有一条出路：实践灵修之路。

source: That moment he felt great wearinesswith the world and renounced the world at the age of 29.
zh_cn: 那一刻佛陀对这个世界生起了强烈的厌离心并宣布放弃世间的一切，那一年他29岁。

source: He left his worldly royal life in search of the truth.
zh_cn: 为了寻求实相，佛陀离开了尘世的王族生活。

source: Seventh Deed: Practice of Austerities and Asceticism, and then Renouncing them
zh_cn: 第七行谊：实践苦行和放弃苦行

source: After the Buddha left home, he led a life of austerities for six years by the banks of the Nirajana river in India.
zh_cn: 佛陀离开家后，在印度的尼连禅河河畔过了六年的苦行生活。

source: These austerities did not lead to his enlightenment, but the years spent doing ascetic practices were not wasted because they had the specific purpose of showing future disciples that the Buddha had put a very great amount of effort, perseverance and diligence into achieving the goal of enlightenment.
zh_cn: 这些苦行并没有让他觉悟，但实践苦行的这些年并不浪费，因为这有特别的意图：就是为了告诉未来的弟子，佛陀为了实现开悟的目标，坚持不懈、勤奋精进，付出了极其巨大的努力。

source: By doing this, the Buddha demonstrated that as long as someone is attached to money, food, clothes, and all the pleasures of life, full dedication to spiritual practice is impossible.
zh_cn: 通过这样做，佛陀证明了只要人们还恋慕着金钱、食物、衣服和所有生活的享乐，就不可能全身心地投入精神修行。

source: But if one gives up attachment, then the achievement of Buddhahood becomes a possibility.
zh_cn: 但如果一个人放弃这些执着，就有可能成佛。

source: So that is why the Buddha engaged in this deed of six years of austerities by a riverside.
zh_cn: 这就是为什么佛陀在河畔进行六年苦行的原因。

source: In the end, the Buddha gave up the practice of austerities, by accepting a bowl of yogurt.
zh_cn: 最后，佛陀接受了一碗乳糜供养，放弃了苦行。

source: In contrast to the austerities, the Buddha ate this nutritious food and gave his body a rest (regaining all his physical splendor and health). He put his clothes back on and went to the bodhi tree in Bodh Gaya.
zh_cn: 与苦行形成对比，佛陀吃了这份有营养的食物，然后让身体休息了一会(重新焕发活力、恢复了健康)。他重新穿上衣服，来到了菩提伽耶的一棵菩提树下。

source: The Buddha gave up the austerities to show his future followers that the main object of Buddhist practice is working with one's mind.
zh_cn: 佛陀放弃了苦行是要告诉他未来的弟子，佛法实践的主要对象是心灵的修炼。

source: We have to eliminate the negativity in our mind and have to develop the positive qualities of knowledge and understanding.
zh_cn: 我们必须消除内在的消极因素，必须不断发展积极的认知和领悟。

source: This is far more important than what goes on outside of us.
zh_cn: 这远远比我们身外之物更加重要。

source: So, austerities are not the point in themselves, they alone do not bring us enlightenment.
zh_cn: 因此，苦行本身并不是目的，单单依靠苦行无法令我们觉悟。

source: Eighth Deed: Taking His place at the Vajrasana in Bodh Gaya, the seat under the Bodhi Tree
zh_cn: 第八行谊：坐金刚座，在菩提伽耶的一棵菩提树下

source: After giving up the ascetic practice, the Buddha went to the bodhi tree and vowed to stay under this tree until he reached final awakening.
zh_cn: 放弃苦行后，佛陀来到菩提树下，并立誓不觉悟就不离开这里。

source: By doing so, the Buddha demonstrated to us that true practice should be in the middle of the two extremes: practicing too many austerities and being too indulgent.
zh_cn: 佛陀这样做是向我们显示，正确的实践应该在两个极端——行过多的苦修和过于放纵欲望——之间。

source: The first extreme is when you starve yourself or you don't allow yourself food and drink.
zh_cn: 第一个极端是让自己饥饿或不允许自己进食，包括固体和液体食品。

source: These practices also involve placing yourself inextreme physical conditions such as being too hot or too cold.
zh_cn: 这些苦行修炼同样会让自己的身体处于过热或过冷的极端状态。

source: This is pointless because it has no true significance.
zh_cn: 这是没有意义的，因为它事实上并不重要。

source: The other extreme is when you just follow any of your desires.
zh_cn: 另一个极端是你只追随自己的任何欲望。

source: This is endless because there is a constant escalation in your desires.
zh_cn: 这是没有尽头的，因为这只会持续地扩大你的欲望。

source: If you have ten pleasures, you'll want a hundred.
zh_cn: 如果你拥有十种享受，你还会想要有一百种。

source: If you have a hundred, you'll want a thousand; so you will never find any satisfaction and you will also never be able to practice the dharma either.
zh_cn: 等你拥有了一百种，你还会想有一千。因此你永远不会感到满足，同样的，你也无法修习法义。

source: So the Buddha wanted to show us that we have to avoid the extreme of too much austerity and too much indulgence: true practice lies somewhere in the middle.
zh_cn: 因此佛陀要告诉我们必须避开极端：过度的苦行和太多的放纵；真正的修行在于中道。

source: Ninth Deed: Victory over of the leader of Maras, Papiyan
zh_cn: 第九行谊：战胜魔王波旬

source: When the Buddha was sitting under the bodhi tree, Papiyan, the leader ofMaras, used forms related to the three disturbing emotions (sometimes called kleshas) of ignorance, desire, and aggression to try to lure the Buddha away from his pursuit of enlightenment.
zh_cn: 当佛陀在菩提伽耶菩提树下打坐时，魔军头领波旬——习惯指代相关的三种令人不稳定情绪（有时称为kleshas）：无明、贪欲和嗔恨——企图诱惑佛陀放弃追求开悟。

source: The first deception, representing ignorance, was that the Buddha was askedto abandon his meditation and return immediately to the kingdom because his father King Shuddhodana had died and the evil Devadatta had taken over the kingdom.
zh_cn: 魔王的第一条诡计，代表无明，是要求佛陀放弃他的入定，立刻回到王国，因为他的父王净饭王过世了，并且邪恶的提婆达多控制了这个国家。

source: This did not disturb the Buddha's meditation.
zh_cn: 这没有扰乱佛陀的入定。

source: Then Papiyan tried to create an obstacle using desire; his beautiful daughters tried to deceive and seduce the Buddha.
zh_cn: 接着波旬企图用欲望作为障碍；他那些姿态妖娆的女儿们努力去欺骗和引诱佛陀。

source: When this did not disturb the Buddha's meditation, Mara then used hatred by coming towards the Buddha surrounded by millions of horribly frightening warriors who were throwing weapons at the Buddha's body.
zh_cn: 当这个没有干扰佛陀的入定后，魔王就用仇恨让数百万令人恐惧的武士包围佛陀，他们不停地把兵器投向佛陀的身体。

source: But the Buddha wasn't distracted or fooled by these three poisons.
zh_cn: 但佛陀没有被这三种毒计分心或愚弄。

source: He remained immersed in compassion and loving-kindness and therefore triumphed over this display of the three poisons and was able to eventually achieve enlightenment.
zh_cn: 他依然充满着怜悯和慈悲，从而战胜了三毒（无明、贪欲和嗔恨）的幻相，并且能够最终觉悟。

source: (This deed of the Buddha is represented by the image of theBuddha "taking the earth as witness,"gently touching the ground with his right hand and holding a begging bowl in his left hand.
zh_cn: （佛陀的这一行谊以“大地为证”的佛陀形象为表征，他柔和地以右手触碰大地，左手持钵。

source: The Buddha wasn't tricked byMara's deceptions, and also miraculously proved to Mara that for eons he performed innumerable good deeds by having the earth itself testify)
zh_cn: 佛陀没有被魔王的诡计欺骗，还奇迹般地向魔王证明他将以大地为证、永世行善。）
